In [1]:
import pandas as pd

In [2]:
df_train = pd.read_csv('test_m.csv')
df_train.head()

,ID,Gender,Age,Region_Code,Occupation,Channel_Code,Vintage,Credit_Product,Avg_Account_Balance,Is_Active
0,VBENBARO,Male,29,RG254,Other,X1,25,Yes,742366,No
1,CCMEWNKY,Male,43,RG268,Other,X2,49,NaN,925537,No
2,VK3KGA9M,Male,31,RG270,Salaried,X1,14,No,215949,No
3,TT8RPZVC,Male,29,RG272,Other,X1,33,No,868070,No
4,SHQZEYTZ,Female,29,RG270,Other,X1,19,No,657087,No

In [3]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105312 entries, 0 to 105311
Data columns (total 10 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   105312 non-null  object
 1   Gender               105312 non-null  object
 2   Age                  105312 non-null  int64
 3   Region_Code          105312 non-null  object
 4   Occupation           105312 non-null  object
 5   Channel_Code         105312 non-null  object
 6   Vintage              105312 non-null  int64
 7   Credit_Product       92790 non-null   object
 8   Avg_Account_Balance  105312 non-null  int64
 9   Is_Active            105312 non-null  object
dtypes: int64(3), object(7)
memory usage: 8.0+ MB

In [4]:
#Counting or checking total number of null values 
df_train.isnull().sum()

ID                         0
Gender                     0
Age                        0
Region_Code                0
Occupation                 0
Channel_Code               0
Vintage                    0
Credit_Product         12522
Avg_Account_Balance        0
Is_Active                  0
dtype: int64

In [5]:
#Counting categorised occupations
df_train['Occupation'].value_counts()

Self_Employed    43192
Salaried         30913
Other            30131
Entrepreneur      1076
Name: Occupation, dtype: int64

In [6]:
#Counting whether customer is active or not in the past three months 
df_train['Is_Active'].value_counts()

No     63797
Yes    41515
Name: Is_Active, dtype: int64

In [7]:
#Customers who has borrowed credits

df_train['Credit_Product'].value_counts()

No     61608
Yes    31182
Name: Credit_Product, dtype: int64

In [8]:
df_train['Channel_Code'].value_counts()

X1    44484
X3    29269
X2    29176
X4     2383
Name: Channel_Code, dtype: int64

In [9]:
#Reading sample data

df_sample = pd.read_csv('sample_submission.csv')
df_sample.head()

         ID  Is_Lead
0  VBENBARO        0
1  CCMEWNKY        0
2  VK3KGA9M        0
3  TT8RPZVC        0
4  SHQZEYTZ        0

In [10]:
#merging two dataframe with target values
df_train = pd.merge(df_train,df_sample,on='ID')

In [11]:
df_train.head()

,ID,Gender,Age,Region_Code,Occupation,Channel_Code,Vintage,Credit_Product,Avg_Account_Balance,Is_Active,Is_Lead
0,VBENBARO,Male,29,RG254,Other,X1,25,Yes,742366,No,0
1,CCMEWNKY,Male,43,RG268,Other,X2,49,NaN,925537,No,0
2,VK3KGA9M,Male,31,RG270,Salaried,X1,14,No,215949,No,0
3,TT8RPZVC,Male,29,RG272,Other,X1,33,No,868070,No,0
4,SHQZEYTZ,Female,29,RG270,Other,X1,19,No,657087,No,0

In [12]:
max(df_train['Age'])

85

In [17]:
#Age other than senior citizen
agelist=[i for i in df_train['Age'] if i<=65]

In [18]:
len(agelist)

95477

In [16]:
min(df_train['Avg_Account_Balance'])

22597

In [19]:
df_train['Region_Code'].value_counts()

RG268    15125
RG283    12881
RG254    11737
RG284     8173
RG277     5596
RG280     5529
RG270     3440
RG269     3288
RG261     3286
RG251     2678
RG257     2588
RG272     2338
RG282     2337
RG274     2208
RG281     2144
RG252     1811
RG273     1803
RG263     1615
RG279     1600
RG275     1383
RG260     1300
RG264     1241
RG256     1194
RG276     1185
RG259     1102
RG250     1048
RG255      891
RG278      824
RG258      812
RG253      810
RG262      800
RG265      668
RG271      654
RG266      631
RG267      592
Name: Region_Code, dtype: int64

In [21]:
import seaborn as sns
import matplotlib.pyplot as plt